package meituan;
//美团 2022届秋招 技术综合-数据开发方向在线考试
//        编程题|20.0分1/4
//        整除
//        时间限制： 5000MS
//        内存限制： 655360KB
//        题目描述：
//        小美最近迷上了22这个数字，一天，她发现他的一本书中有一个神秘的大数字。于是她想知道这个数字中有多少子串代表的数字能被22整除。
//
//
//
//        输入描述
//        一行一个只由数字组成的不含前导零的字符串，字符串长度为 n(1≤n≤105)。
//
//        输出描述
//        一行一个整数代表有多少这个字符串的子串代表的数字能被 22 整除。
//
//
//        样例输入
//        12221
//        样例输出
//        2
//
//        提示
//        样例解释
//
//        [2,3] [3,4] 代表的子串为22，可以被22整除。
public class T1 {
}
